# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [2]:
# your answer here
employee = pd.read_csv('data/Employee.csv')
employee.head(30)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [3]:
# Method 1
# your answer here

In [75]:
groupbe_department = employee.groupby('Department')
groupbe_department

In [77]:
mean_salary = groupbe_department['Salary'].mean()
mean_salary

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [6]:
# Method 2
# your answer here

In [7]:
# your answer here
pivot_table_mean_salary = employee.pivot_table(values='Salary', index='Department',aggfunc='mean')
pivot_table_mean_salary

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [8]:
# your answer here

In [9]:
pivot_table_years = employee.pivot_table(values=['Salary','Years'],index="Title", aggfunc='mean').reset_index()
pivot_table_years.head()

       Title     Salary  Years
0         VP  70.000000   8.00
1    analyst  32.500000   2.25
2  associate  56.666667   4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [10]:
Number_employee= employee.groupby(['Department','Title']).size().reset_index(name="Number_employee_department")
Number_employee
type (Number_employee)

pandas.core.frame.DataFrame

In [11]:
mean_salary_each_job_title = employee.merge(Number_employee, on=['Department','Title'])
mean_salary_each_job_title

,Name,Department,Education,Gender,Title,Years,Salary,Number_employee_department
0,Jose,IT,Bachelor,M,analyst,1,35,2
1,Maria,IT,Master,F,analyst,2,30,2
2,David,HR,Master,M,analyst,2,30,2
3,Sonia,HR,Bachelor,F,analyst,4,35,2
4,Samuel,Sales,Master,M,associate,3,55,2
5,Eva,Sales,Bachelor,F,associate,2,55,2
6,Carlos,IT,Master,M,VP,8,70,1
7,Pedro,IT,Phd,M,associate,7,60,1
8,Ana,HR,Master,F,VP,8,70,1

In [26]:
mean_salary_each_job_title = mean_salary_each_job_title.pivot_table(values=['Salary'], 
                                                     index=['Department','Title'],
                                                  aggfunc={"Salary":'mean'})

mean_salary_each_job_title

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [13]:
# your answer here

In [33]:
salary_stats = employee.groupby(['Department','Title'])['Salary'].agg(['median','min','max','std'])
display(salary_stats)

                      median  min  max       std
Department Title
HR         VP           70.0   70   70       NaN
           analyst      32.5   30   35  3.535534
IT         VP           70.0   70   70       NaN
           analyst      32.5   30   35  3.535534
           associate    60.0   60   60       NaN
Sales      associate    55.0   55   55  0.000000

In [ ]:
#standard deviation, content NaN results.

#### Based on your comments, fill the missing values with an appropriate value.

In [14]:
# your answer here

In [46]:
sd_salary_each_job_title = employee.groupby(['Department','Title'])['Salary'].std().reset_index()

sd_salary_each_job_title

  Department      Title    Salary
0         HR         VP       NaN
1         HR    analyst  3.535534
2         IT         VP       NaN
3         IT    analyst  3.535534
4         IT  associate       NaN
5      Sales  associate  0.000000

In [50]:
sd_salary_each_job_title.fillna("Unknown")

  Department      Title    Salary
0         HR         VP   Unknown
1         HR    analyst  3.535534
2         IT         VP   Unknown
3         IT    analyst  3.535534
4         IT  associate   Unknown
5      Sales  associate       0.0

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [61]:
# your answer here

number_employee_department = employee.groupby('Department').size().reset_index(name="number_of_employees")

In [62]:
salary_spend_by_department = employee.groupby('Department')['Salary'].sum().reset_index(name="Total_salary")

In [64]:
result =pd.merge(number_employee_department,salary_spend_by_department, on="Department")
result

  Department  number_of_employees  Total_salary
0         HR                    3           135
1         IT                    4           195
2      Sales                    2           110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [16]:
# your answer here

In [81]:
experience_and_salary = employee.groupby(['Department','Title'])['Years'].agg(['sum','mean'])
                        
experience_and_salary

                      sum  mean
Department Title
HR         VP           8   8.0
           analyst      6   3.0
IT         VP           8   8.0
           analyst      3   1.5
           associate    7   7.0
Sales      associate    5   2.5

In [82]:
experience_and_salary= experience_and_salary.rename(columns={'sum':'Total_years_Experience','mean':'Mean_Years_Experience'})

experience_and_salary

                      Total_years_Experience  Mean_Years_Experience
Department Title
HR         VP                              8                    8.0
           analyst                         6                    3.0
IT         VP                              8                    8.0
           analyst                         3                    1.5
           associate                       7                    7.0
Sales      associate                       5                    2.5

In [84]:
experience_and_salary ['Mean_Salary'] = employee.groupby(['Department','Title'])['Salary'].mean()
experience_and_salary ['Mean_Salary']

Department  Title
HR          VP           70.0
            analyst      32.5
IT          VP           70.0
            analyst      32.5
            associate    60.0
Sales       associate    55.0
Name: Mean_Salary, dtype: float64

In [85]:
experience_and_salary

                      Total_years_Experience  Mean_Years_Experience  \
Department Title
HR         VP                              8                    8.0
           analyst                         6                    3.0
IT         VP                              8                    8.0
           analyst                         3                    1.5
           associate                       7                    7.0
Sales      associate                       5                    2.5

                      Mean_Salary
Department Title
HR         VP                70.0
           analyst           32.5
IT         VP                70.0
           analyst           32.5
           associate         60.0
Sales      associate         55.0

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [17]:
# your answer here

In [90]:
def remove_max(x):
    return x[x!=x.max()].mean()

In [91]:
mean_salary_without_max = employee.pivot_table(values='Salary',index='Department',aggfunc=remove_max)
mean_salary_without_max

               Salary
Department
HR          32.500000
IT          41.666667